ezois_ka/oooezoiskaobmen/src/Documents/ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудника/ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудника</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЭлектронногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтменяемойЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОтменяемогоЭлектронногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>72</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантИсправления</name>
    <type>
      <types>EnumRef.ВариантыИсправленияЗаявокКабинетСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменяемаяЗаявка</name>
    <type>
      <types>DefinedType.ЗаявкаКабинетСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипыОбъектовИнтеграцияУправлениеПерсоналом</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ТипыЗаявокКабинетСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветПоЗаявке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыходаНаРаботу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийСотрудника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.РезультатыВыполненияЗаявокКабинетСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонДокумента</name>
    <type>
      <types>CatalogRef.ШаблоныДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыПоЗаявке</name>
    <attributes>
      <name>ДокументСсылка</name>
      <type>
        <types>DocumentRef.ВозвратИзОтпускаПоУходуЗаРебенком</types>
        <types>DocumentRef.ОтпускПоУходуЗаРебенком</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen/src/Enums/ТипыОбъектовИнтеграцияУправлениеПерсоналом/ТипыОбъектовИнтеграцияУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовИнтеграцияУправлениеПерсоналом</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Должность</name>
  </enumValues>
  <enumValues>
    <name>ДолжностьПоШтатномуРасписанию</name>
  </enumValues>
  <enumValues>
    <name>Сотрудник</name>
  </enumValues>
  <enumValues>
    <name>ГрафикРаботы</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусковПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусковПодразделения</name>
  </enumValues>
  <enumValues>
    <name>ВерсииФормата</name>
  </enumValues>
  <enumValues>
    <name>ВсеИзменения</name>
  </enumValues>
  <enumValues>
    <name>ВидПредоставляемойСотрудникамСправки</name>
  </enumValues>
  <enumValues>
    <name>Оффер</name>
  </enumValues>
  <enumValues>
    <name>ОграничениеДоступаКРабочимКонтактам</name>
  </enumValues>
  <enumValues>
    <name>ДоступныеФункцииФизическогоЛица</name>
  </enumValues>
  <enumValues>
    <name>ДокументНаПодпись</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаПрисоединениеКЭДОБЗК</name>
  </enumValues>
  <enumValues>
    <name>МашиночитаемаяДоверенность</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправкиСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаИзменениеЛичныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНалоговыйВычет</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаКомпенсациюОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>Отсутствие</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаДСВ</name>
  </enumValues>
  <enumValues>
    <name>ГрафикОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ЗаработанныеПраваНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ПрименяемыеВычетыНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ПраздничныеДниГрафикаРаботы</name>
  </enumValues>
  <enumValues>
    <name>РезультатСогласования</name>
  </enumValues>
  <enumValues>
    <name>ПравилоСогласования</name>
  </enumValues>
  <enumValues>
    <name>РасчетныйЛисток</name>
  </enumValues>
  <enumValues>
    <name>ПлановоеУдержание</name>
  </enumValues>
  <enumValues>
    <name>БудущееИзменениеОстаткаОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ДанныеГрафикаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОбИспользованииОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ВидСоставнойЧастиЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>Справка2НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>СправкаСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>СправкаОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>ИспользуемаяФункциональность</name>
  </enumValues>
  <enumValues>
    <name>НастройкиЗаявленийНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ДоступностьПриложения</name>
  </enumValues>
  <enumValues>
    <name>ШаблонДокумента</name>
  </enumValues>
  <enumValues>
    <name>ОбращениеСотрудника</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаЗарплатаСразу</name>
  </enumValues>
  <enumValues>
    <name>РабочееМестоОхраныТруда</name>
  </enumValues>
  <enumValues>
    <name>ВидОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиОтпусков</name>
  </enumValues>
  <enumValues>
    <name>НастройкиОтсутствий</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОПриложении</name>
  </enumValues>
  <enumValues>
    <name>НастройкиПриложения</name>
  </enumValues>
  <enumValues>
    <name>ВнешнееФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаПереносОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОтменаЗаявки</name>
  </enumValues>
  <enumValues>
    <name>НастройкиСервисаПодписания</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаУчебныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеОсмотры</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхДляОформленияНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>ДанныеДляОформленияНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеПособиеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзОтпускаПоУходуЗаРебенком</name>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen/src/Enums/ТипыЗаявокКабинетСотрудника/ТипыЗаявокКабинетСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаявокКабинетСотрудника</name>
  <enumValues>
    <name>СправкаНДФЛ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаКомпенсациюОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеЛичныхДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаУдержаниеДСВ</name>
  </enumValues>
  <enumValues>
    <name>СправкаСМестаРаботы</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаОтпуск</name>
  </enumValues>
  <enumValues>
    <name>СправкаОбОстаткеОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаНалоговыеВычеты</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОтсутствия</name>
  </enumValues>
  <enumValues>
    <name>ОбращениеСотрудника</name>
  </enumValues>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>ОтпускБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>УчебныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияОтпуска</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОпозданиеЛичныеДела</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ДниУходаЗаДетьмиИнвалидами</name>
  </enumValues>
  <enumValues>
    <name>ПособиеПриРожденииРебенка</name>
  </enumValues>
  <enumValues>
    <name>ЕжемесячноеПособиеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзОтпускаПоУходуЗаРебенком</name>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen/src/Documents/ЗаявкаОтпускПоУходуЗаРебенкомКабинетСотрудника/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Сотрудник = КадровыйУчет.ОсновнойСотрудникФизическогоЛица(ФизическоеЛицо, Организация, ДатаСоздания);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОтменяемаяЗаявка) Тогда
			ТипЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтменяемаяЗаявка, "ТипЗаявки");
		Иначе
			Если ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ОтпускПоУходуЗаРебенком Тогда
				ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ОтпускПоУходуЗаРебенком;
			ИначеЕсли ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ВозвратИзОтпускаПоУходуЗаРебенком Тогда
				ТипЗаявки = Перечисления.ТипыЗаявокКабинетСотрудника.ВозвратИзОтпускаПоУходуЗаРебенком;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() И ПометкаУдаления И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
		Если Не Пользователи.ЭтоПолноправныйПользователь(, , Ложь)
			И Не ДополнительныеСвойства.Свойство("РазрешенаПометкаУдаления") Тогда
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Пометка на удаление объектов ""%1"" не предусмотрена'"),
			Метаданные().Синоним);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	РезультатВыполненияЗаявки = Неопределено;
	Если ДополнительныеСвойства.Свойство("РезультатВыполненияЗаявки", РезультатВыполненияЗаявки) Тогда
		ЗаявкиСотрудников.ПередЗаписьюВыполняемойЗаявки(ЭтотОбъект, РезультатВыполненияЗаявки, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
